/*
Определение DOM

DOM (Document Object Model) - это объектное представление HTML-документа.
Позволяет JavaScript манипулировать элементами HTML-страницы (добавление, удаление, изменение элементов и их свойств).

Важность DOM

Фундамент для фреймворков (React, Angular, Vue).
Обеспечивает динамичность и интерактивность веб-страниц.
DOM API

Один из внешних API, встроенных в браузер, позволяющих взаимодействовать с HTML.
Различие с Node.js

DOM доступен только в браузере.
В Node.js используются псевдо-API для сервер-сайда рендеринга.
Структура DOM

Дерево объектов, начинающееся с "документа", содержит вложенные элементы (head, body и др.).
Каждый узел дерева может содержать атрибуты и текст.
Работа с DOM

Используются методы для выбора элементов (по идентификатору, классу и т.д.).
Можно добавлять, удалять или изменять элементы и их свойства.
*/